Catalogs/КСУ_ИнструкцииКЗаказам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КСУ_ИнструкцииКЗаказам</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Инструкция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonForms/ИА_ФП_БазаЗнанийПЗП/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТолькоПросмотр = Истина;
	//Если Параметры.Свойство("ТолькоПросмотр") Тогда
	//	 ТолькоПросмотр = Параметры.ТолькоПросмотр;
	//КонецЕсли;
	
	Элементы.ГруппаКПФД.Видимость = Не ТолькоПросмотр;
	Элементы.ЗаписатьИЗакрыть.Видимость = Не ТолькоПросмотр;
	Элементы.ФормаЗаписать.Видимость = Не ТолькоПросмотр;
	Элементы.ФорматДок.ТолькоПросмотр = ТолькоПросмотр;
	
	ТекстИнструкции = "";
	Запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	КСУ_ИнструкцииКЗаказам.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.КСУ_ИнструкцииКЗаказам КАК КСУ_ИнструкцииКЗаказам
	               |ГДЕ
	               |	КСУ_ИнструкцииКЗаказам.Организация = &Организация
	               |	И КСУ_ИнструкцииКЗаказам.ПометкаУдаления = ложь";
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	Выборка = запрос.Выполнить().Выбрать();
	
	Если выборка.Следующий() Тогда
		ТекстИнструкции = выборка.ссылка.инструкция;
	Иначе
		ТекстИнструкции = Справочники.КСУ_ИнструкцииКЗаказам.ДляВсехОрганизаций.Инструкция;
	КонецЕсли;
	
	Если ТекстИнструкции = "" тогда
		возврат;
	КонецЕсли;
	
	ВложенияСтруктура = Новый Структура;
	ФорматДок.УстановитьHTML(ТекстИнструкции, ВложенияСтруктура);
	
КонецПроцедуры

&НаКлиенте
Процедура Записать(Команда)
	ЗаписатьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьНаКлиенте()
	ЗаписатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаписатьНаСервере()
	
	ВложенияСтруктура = Новый Структура;
	Определение ="";
	ФорматДок.ПолучитьHTML(Определение, ВложенияСтруктура);
	
	Вложения = Новый ХранилищеЗначения(ВложенияСтруктура);
	
	Константы.ИА_ФП_БазаЗнанийПЗП.Установить(Определение);

КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	ЗаписатьНаКлиенте();
	Закрыть();
КонецПроцедуры
